/*题目描述
求1+2!+3!+...+N!的和
输入格式
正整数N（N〈=20）
输出格式
1+2!+3!+...+N!的和 (结果为整数形式)*/
#include <iostream>
using namespace std;
/***************************************************************************/
int main(){
    long long a, b, c,d,e[10000],f,g,h,y,f2,f3;
    cin>>a;//a=9
    b = 1;
    d=1;
    g=-1;
    for(f=0;f<=10000;f++){
	e[f] = 0;//0
	}
    for(;d<=a;d=d+1){//x9;
    //z= z+1;  
	/******************************************************************/ 
	for(c = 1;c<=d;c++){
		b=1;
		h = b*c;
		g  = f2;
	    e[g]=h;
		f2 = g+1;
		cout<<g<<endl;
	}
}   
    //cout<<g; 
    g=0;
    b=0;
    y=0;
    for(f=0;f<=10000;f++){
    	f3=y+e[f];
    	//cout<<e[f]<<" ";
    	y=f3;
	}
	cout<<y;
    //cout<<z;
    return 0;
    
}
